package com.sist.main;
/*
 *    객체지향 프로그램 : 하드웨어 (집적회로 => 모방)
 *    ------------ 조립식 (한개 클래스 => 부품) => CBD
 *    => 이미 만들어진 클래스 : 변경(요구사항) => 오버라이딩
 *    1차 프로젝트 ===> 2차 프로젝트 (오버라이딩)
 *    ----------------------------------- 재사용
 *    
 *    1. 목적 => 재사용
 *              ---- 변경이 가능 , 추가가 가능
 *                   ---       ----
 *                   오버라이딩   오버로딩
 *                   
 *    2. 신뢰성이 좋다 : 검증을 거친다
 *    3. 대규모 프로젝트 => 재사용
 *       안산시청 ==> 서울시청
 *    4. 클래스 => 추상화 => 구체화
 *              -----설계 ---- 구현
 *              | 공통적인 데이터나 기능을 모아서 설계
 *                ---------------
 *                벤치마킹(영화사 등등)
 *                      ---------
 *                      | 불편한 점 => 사용자 편리성
 *              |(추상화) 단순화 : 시뮬레이션
 *              
 *              | 공통적인 데이터 / 기능
 *                             ---- 메소드
 *                                  ----- 동작
 *                                  메뉴 / 버튼 / 마우스 ...
 *                                  ---   ---
 *                ----------- 변수
 *                            --- 눈에 보이는 데이터 : 명사형
 *          1. 변수 설정
 *             => 기능(메소드에서 공통으로 사용되는 변수)
 *             
 *             예)
 *                 달력
 *                 사용자로부터 입력값을 받는다 : year/month
 *                 요일을 구한다 : week
 *                 달력 출력 : week로부터 => 1.... year/month
 *                 => 전역 변수 / 멤버변수
 *             => 어떤 기능 => 사용되는 변수 => 중복
 *             
 */
public class 정리_6장 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
